#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.8`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.data_management_zone.data.azuread_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azuread_application_template.scim: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azuread_client_config.current: Read complete after 0s [id=37963dd4-f4e6-40f8-a7d6-24b97919e452-320d6fb4-6716-479f-bd77-bf80ef559b74-612081e2-c034-4d91-91f8-50c4390fbf50][0m
[0m[1mmodule.data_management_zone.data.azuread_application_template.scim: Read complete after 1s [id=9c9818d2-2900-49e8-8ba4-22688be7c675][0m
[0m[1mmodule.data_management_zone.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.purview_account.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.key_vault_scim.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.purview_account.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.module.key_vault_scim.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.module.key_vault_purview.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.key_vault_purview.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.data.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mmodule.data_management_zone.data.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mmodule.data_management_zone.data.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.data_management_zone.data.azuread_service_principal.databricks_account_scim_service_principal[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azuread_service_principal" "databricks_account_scim_service_principal" {
      [32m+[0m[0m account_enabled               = (known after apply)
      [32m+[0m[0m alternative_names             = (known after apply)
      [32m+[0m[0m app_role_assignment_required  = (known after apply)
      [32m+[0m[0m app_role_ids                  = (known after apply)
      [32m+[0m[0m app_roles                     = (known after apply)
      [32m+[0m[0m application_id                = (known after apply)
      [32m+[0m[0m application_tenant_id         = (known after apply)
      [32m+[0m[0m client_id                     = (known after apply)
      [32m+[0m[0m description                   = (known after apply)
      [32m+[0m[0m display_name                  = (known after apply)
      [32m+[0m[0m feature_tags                  = (known after apply)
      [32m+[0m[0m features                      = (known after apply)
      [32m+[0m[0m homepage_url                  = (known after apply)
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m login_url                     = (known after apply)
      [32m+[0m[0m logout_url                    = (known after apply)
      [32m+[0m[0m notes                         = (known after apply)
      [32m+[0m[0m notification_email_addresses  = (known after apply)
      [32m+[0m[0m oauth2_permission_scope_ids   = (known after apply)
      [32m+[0m[0m oauth2_permission_scopes      = (known after apply)
      [32m+[0m[0m object_id                     = (known after apply)
      [32m+[0m[0m preferred_single_sign_on_mode = (known after apply)
      [32m+[0m[0m redirect_uris                 = (known after apply)
      [32m+[0m[0m saml_metadata_url             = (known after apply)
      [32m+[0m[0m saml_single_sign_on           = (known after apply)
      [32m+[0m[0m service_principal_names       = (known after apply)
      [32m+[0m[0m sign_in_audience              = (known after apply)
      [32m+[0m[0m tags                          = (known after apply)
      [32m+[0m[0m type                          = (known after apply)
    }

[1m  # module.data_management_zone.data.azurerm_key_vault_secret.key_vault_secret_databricks_account_scim_token[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_key_vault_secret" "key_vault_secret_databricks_account_scim_token" {
      [32m+[0m[0m content_type            = (known after apply)
      [32m+[0m[0m expiration_date         = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = (known after apply)
      [32m+[0m[0m name                    = "scim-token"
      [32m+[0m[0m not_before_date         = (known after apply)
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m tags                    = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # module.data_management_zone.azapi_resource.private_endpoint_subnet[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "private_endpoint_subnet" {
      [32m+[0m[0m body                      = {
          [32m+[0m[0m properties = {
              [32m+[0m[0m addressPrefix                     = "10.1.0.0/27"
              [32m+[0m[0m delegations                       = []
              [32m+[0m[0m ipAllocations                     = []
              [32m+[0m[0m networkSecurityGroup              = {
                  [32m+[0m[0m id = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001"
                }
              [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
              [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
              [32m+[0m[0m routeTable                        = {
                  [32m+[0m[0m id = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001"
                }
              [32m+[0m[0m serviceEndpointPolicies           = []
              [32m+[0m[0m serviceEndpoints                  = []
            }
        }
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m name                      = "ServicesSubnet"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001"
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # module.data_management_zone.azuread_application.databricks_account_scim_application[0m will be created
[0m  [32m+[0m[0m resource "azuread_application" "databricks_account_scim_application" {
      [32m+[0m[0m app_role_ids                  = (known after apply)
      [32m+[0m[0m application_id                = (known after apply)
      [32m+[0m[0m client_id                     = (known after apply)
      [32m+[0m[0m description                   = "Databricks account SCIM application."
      [32m+[0m[0m disabled_by_microsoft         = (known after apply)
      [32m+[0m[0m display_name                  = "databricks-account-scim-provisioning"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m logo_url                      = (known after apply)
      [32m+[0m[0m oauth2_permission_scope_ids   = (known after apply)
      [32m+[0m[0m oauth2_post_response_required = false
      [32m+[0m[0m object_id                     = (known after apply)
      [32m+[0m[0m owners                        = [
          [32m+[0m[0m "612081e2-c034-4d91-91f8-50c4390fbf50",
        ]
      [32m+[0m[0m prevent_duplicate_names       = true
      [32m+[0m[0m publisher_domain              = (known after apply)
      [32m+[0m[0m sign_in_audience              = "AzureADMyOrg"
      [32m+[0m[0m tags                          = [
          [32m+[0m[0m "Description: This SPN is used for databricks SCIM configuration for the Databricks Account",
          [32m+[0m[0m "Owner: 320d6fb4-6716-479f-bd77-bf80ef559b74",
        ]
      [32m+[0m[0m template_id                   = "9c9818d2-2900-49e8-8ba4-22688be7c675"

      [32m+[0m[0m app_role {
          [32m+[0m[0m allowed_member_types = [
              [32m+[0m[0m "Application",
              [32m+[0m[0m "User",
            ]
          [32m+[0m[0m description          = "Users can perform limited actions"
          [32m+[0m[0m display_name         = "User"
          [32m+[0m[0m enabled              = true
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m value                = "User"
        }

      [32m+[0m[0m feature_tags (known after apply)

      [32m+[0m[0m password (known after apply)
    }

[1m  # module.data_management_zone.azuread_synchronization_secret.synchronization[0m will be created
[0m  [32m+[0m[0m resource "azuread_synchronization_secret" "synchronization" {
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m service_principal_id = (known after apply)

      [32m+[0m[0m credential {
          [32m+[0m[0m key   = "BaseAddress"
          [32m+[0m[0m value = (sensitive value)
        }
      [32m+[0m[0m credential {
          [32m+[0m[0m key   = "SecretToken"
          [32m+[0m[0m value = (sensitive value)
        }
      [32m+[0m[0m credential {
          [32m+[0m[0m key   = "SyncAll"
          [32m+[0m[0m value = (sensitive value)
        }
      [32m+[0m[0m credential {
          [32m+[0m[0m key   = "SyncNotificationSettings"
          [32m+[0m[0m value = (sensitive value)
        }
    }

[1m  # module.data_management_zone.azurerm_network_security_group.network_security_group_databricks["northeurope"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_network_security_group" "network_security_group_databricks" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "mydmgmt-dev-northeurope-nsg001"
      [32m+[0m[0m resource_group_name = "mydmgmt-dev-consumption-adb-northeurope-rg"
      [32m+[0m[0m security_rule       = (known after apply)
    }

[1m  # module.data_management_zone.azurerm_network_security_group.network_security_group_databricks["westus"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_network_security_group" "network_security_group_databricks" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "westus"
      [32m+[0m[0m name                = "mydmgmt-dev-westus-nsg001"
      [32m+[0m[0m resource_group_name = "mydmgmt-dev-consumption-adb-westus-rg"
      [32m+[0m[0m security_rule       = (known after apply)
    }

[1m  # module.data_management_zone.azurerm_resource_group.automation_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "automation_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-automation-rg"
    }

[1m  # module.data_management_zone.azurerm_resource_group.consumption_adb_rg["northeurope"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "consumption_adb_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-consumption-adb-northeurope-rg"
    }

[1m  # module.data_management_zone.azurerm_resource_group.consumption_adb_rg["westus"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "consumption_adb_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-consumption-adb-westus-rg"
    }

[1m  # module.data_management_zone.azurerm_resource_group.consumption_synapse_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "consumption_synapse_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-consumption-syn-rg"
    }

[1m  # module.data_management_zone.azurerm_resource_group.container_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "container_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-container-rg"
    }

[1m  # module.data_management_zone.azurerm_resource_group.governance_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "governance_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-governance-rg"
    }

[1m  # module.data_management_zone.azurerm_resource_group.scim_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "scim_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-scim-rg"
    }

[1m  # module.data_management_zone.azurerm_role_assignment.purview_roleassignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "purview_roleassignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets User"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_management_zone.azurerm_route_table.route_table_databricks["northeurope"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_route_table" "route_table_databricks" {
      [32m+[0m[0m bgp_route_propagation_enabled = false
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-northeurope-rt001"
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-consumption-adb-northeurope-rg"
      [32m+[0m[0m route                         = []
      [32m+[0m[0m subnets                       = (known after apply)
    }

[1m  # module.data_management_zone.azurerm_route_table.route_table_databricks["westus"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_route_table" "route_table_databricks" {
      [32m+[0m[0m bgp_route_propagation_enabled = false
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westus"
      [32m+[0m[0m name                          = "mydmgmt-dev-westus-rt001"
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-consumption-adb-westus-rg"
      [32m+[0m[0m route                         = []
      [32m+[0m[0m subnets                       = (known after apply)
    }

[1m  # module.data_management_zone.azurerm_virtual_network.virtual_network_databricks["northeurope"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_virtual_network" "virtual_network_databricks" {
      [32m+[0m[0m address_space       = [
          [32m+[0m[0m "10.0.0.0/20",
        ]
      [32m+[0m[0m dns_servers         = []
      [32m+[0m[0m guid                = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "mydmgmt-dev-northeurope-vnet001"
      [32m+[0m[0m resource_group_name = "mydmgmt-dev-consumption-adb-northeurope-rg"
      [32m+[0m[0m subnet              = [
          [32m+[0m[0m {
              [32m+[0m[0m address_prefixes                              = [
                  [32m+[0m[0m "10.0.0.0/26",
                ]
              [32m+[0m[0m default_outbound_access_enabled               = true
              [32m+[0m[0m delegation                                    = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name               = "DatabricksDelegation"
                      [32m+[0m[0m service_delegation = [
                          [32m+[0m[0m {
                              [32m+[0m[0m actions = [
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [32m+[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [32m+[0m[0m id                                            = (known after apply)
              [32m+[0m[0m name                                          = "DatabricksPrivateSubnet"
              [32m+[0m[0m private_endpoint_network_policies             = "Enabled"
              [32m+[0m[0m private_link_service_network_policies_enabled = true
              [32m+[0m[0m route_table_id                                = (known after apply)
              [32m+[0m[0m security_group                                = (known after apply)
              [32m+[0m[0m service_endpoint_policy_ids                   = []
              [32m+[0m[0m service_endpoints                             = []
            },
          [32m+[0m[0m {
              [32m+[0m[0m address_prefixes                              = [
                  [32m+[0m[0m "10.0.0.64/26",
                ]
              [32m+[0m[0m default_outbound_access_enabled               = true
              [32m+[0m[0m delegation                                    = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name               = "DatabricksDelegation"
                      [32m+[0m[0m service_delegation = [
                          [32m+[0m[0m {
                              [32m+[0m[0m actions = [
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [32m+[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [32m+[0m[0m id                                            = (known after apply)
              [32m+[0m[0m name                                          = "DatabricksPublicSubnet"
              [32m+[0m[0m private_endpoint_network_policies             = "Enabled"
              [32m+[0m[0m private_link_service_network_policies_enabled = true
              [32m+[0m[0m route_table_id                                = (known after apply)
              [32m+[0m[0m security_group                                = (known after apply)
              [32m+[0m[0m service_endpoint_policy_ids                   = []
              [32m+[0m[0m service_endpoints                             = []
            },
        ]
    }

[1m  # module.data_management_zone.azurerm_virtual_network.virtual_network_databricks["westus"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_virtual_network" "virtual_network_databricks" {
      [32m+[0m[0m address_space       = [
          [32m+[0m[0m "10.0.0.0/20",
        ]
      [32m+[0m[0m dns_servers         = []
      [32m+[0m[0m guid                = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "westus"
      [32m+[0m[0m name                = "mydmgmt-dev-westus-vnet001"
      [32m+[0m[0m resource_group_name = "mydmgmt-dev-consumption-adb-westus-rg"
      [32m+[0m[0m subnet              = [
          [32m+[0m[0m {
              [32m+[0m[0m address_prefixes                              = [
                  [32m+[0m[0m "10.0.0.0/26",
                ]
              [32m+[0m[0m default_outbound_access_enabled               = true
              [32m+[0m[0m delegation                                    = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name               = "DatabricksDelegation"
                      [32m+[0m[0m service_delegation = [
                          [32m+[0m[0m {
                              [32m+[0m[0m actions = [
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [32m+[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [32m+[0m[0m id                                            = (known after apply)
              [32m+[0m[0m name                                          = "DatabricksPrivateSubnet"
              [32m+[0m[0m private_endpoint_network_policies             = "Enabled"
              [32m+[0m[0m private_link_service_network_policies_enabled = true
              [32m+[0m[0m route_table_id                                = (known after apply)
              [32m+[0m[0m security_group                                = (known after apply)
              [32m+[0m[0m service_endpoint_policy_ids                   = []
              [32m+[0m[0m service_endpoints                             = []
            },
          [32m+[0m[0m {
              [32m+[0m[0m address_prefixes                              = [
                  [32m+[0m[0m "10.0.0.64/26",
                ]
              [32m+[0m[0m default_outbound_access_enabled               = true
              [32m+[0m[0m delegation                                    = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name               = "DatabricksDelegation"
                      [32m+[0m[0m service_delegation = [
                          [32m+[0m[0m {
                              [32m+[0m[0m actions = [
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [32m+[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [32m+[0m[0m id                                            = (known after apply)
              [32m+[0m[0m name                                          = "DatabricksPublicSubnet"
              [32m+[0m[0m private_endpoint_network_policies             = "Enabled"
              [32m+[0m[0m private_link_service_network_policies_enabled = true
              [32m+[0m[0m route_table_id                                = (known after apply)
              [32m+[0m[0m security_group                                = (known after apply)
              [32m+[0m[0m service_endpoint_policy_ids                   = []
              [32m+[0m[0m service_endpoints                             = []
            },
        ]
    }

[1m  # module.data_management_zone.null_resource.databricks_account_scim_token[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "databricks_account_scim_token" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "execute" = (known after apply)
        }
    }

[1m  # module.data_management_zone.random_uuid.databricks_account_scim_uuid[0m will be created
[0m  [32m+[0m[0m resource "random_uuid" "databricks_account_scim_uuid" {
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m result = (known after apply)
    }

[1m  # module.data_management_zone.time_rotating.databricks_account_scim_token_regenerate[0m will be created
[0m  [32m+[0m[0m resource "time_rotating" "databricks_account_scim_token_regenerate" {
      [32m+[0m[0m day              = (known after apply)
      [32m+[0m[0m hour             = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m minute           = (known after apply)
      [32m+[0m[0m month            = (known after apply)
      [32m+[0m[0m rfc3339          = (known after apply)
      [32m+[0m[0m rotation_months  = 1
      [32m+[0m[0m rotation_rfc3339 = (known after apply)
      [32m+[0m[0m second           = (known after apply)
      [32m+[0m[0m unix             = (known after apply)
      [32m+[0m[0m year             = (known after apply)
    }

[1m  # module.data_management_zone.module.container_registry.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_container_registry" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.container_registry.azurerm_container_registry.container_registry[0m will be created
[0m  [32m+[0m[0m resource "azurerm_container_registry" "container_registry" {
      [32m+[0m[0m admin_enabled                 = false
      [32m+[0m[0m admin_password                = (sensitive value)
      [32m+[0m[0m admin_username                = (known after apply)
      [32m+[0m[0m anonymous_pull_enabled        = false
      [32m+[0m[0m data_endpoint_enabled         = false
      [32m+[0m[0m encryption                    = (known after apply)
      [32m+[0m[0m export_policy_enabled         = false
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m login_server                  = (known after apply)
      [32m+[0m[0m name                          = "mydmgmtdevacr001"
      [32m+[0m[0m network_rule_bypass_option    = "AzureServices"
      [32m+[0m[0m network_rule_set              = [
          [32m+[0m[0m {
              [32m+[0m[0m default_action = "Deny"
            },
        ]
      [32m+[0m[0m public_network_access_enabled = false
      [32m+[0m[0m quarantine_policy_enabled     = false
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-container-rg"
      [32m+[0m[0m retention_policy_in_days      = 7
      [32m+[0m[0m sku                           = "Premium"
      [32m+[0m[0m trust_policy_enabled          = false
      [32m+[0m[0m zone_redundancy_enabled       = false

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.data_management_zone.module.container_registry.azurerm_monitor_diagnostic_setting.diagnostic_setting_container_registry["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_container_registry" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.container_registry.azurerm_private_endpoint.container_registry_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "container_registry_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmtdevacr001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmtdevacr001-registry-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-container-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmtdevacr001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmtdevacr001-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "registry",
            ]
        }
    }

[1m  # module.data_management_zone.module.container_registry.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "10s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_management_zone.module.databricks_access_connector["northeurope"].azurerm_databricks_access_connector.databricks_access_connector[0m will be created
[0m  [32m+[0m[0m resource "azurerm_databricks_access_connector" "databricks_access_connector" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "mydmgmt-dev-northeurope-dbac001"
      [32m+[0m[0m resource_group_name = "mydmgmt-dev-consumption-adb-northeurope-rg"

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.data_management_zone.module.databricks_access_connector["westus"].azurerm_databricks_access_connector.databricks_access_connector[0m will be created
[0m  [32m+[0m[0m resource "azurerm_databricks_access_connector" "databricks_access_connector" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "westus"
      [32m+[0m[0m name                = "mydmgmt-dev-westus-dbac001"
      [32m+[0m[0m resource_group_name = "mydmgmt-dev-consumption-adb-westus-rg"

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace["northeurope"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_databricks_workspace" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.databricks_workspace["northeurope"].azurerm_databricks_workspace.databricks_workspace[0m will be created
[0m  [32m+[0m[0m resource "azurerm_databricks_workspace" "databricks_workspace" {
      [32m+[0m[0m access_connector_id                   = (known after apply)
      [32m+[0m[0m customer_managed_key_enabled          = false
      [32m+[0m[0m default_storage_firewall_enabled      = true
      [32m+[0m[0m disk_encryption_set_id                = (known after apply)
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled     = true
      [32m+[0m[0m location                              = "northeurope"
      [32m+[0m[0m managed_disk_identity                 = (known after apply)
      [32m+[0m[0m managed_resource_group_id             = (known after apply)
      [32m+[0m[0m managed_resource_group_name           = "mydmgmt-dev-northeurope-dbw001-rg"
      [32m+[0m[0m name                                  = "mydmgmt-dev-northeurope-dbw001"
      [32m+[0m[0m network_security_group_rules_required = "NoAzureDatabricksRules"
      [32m+[0m[0m public_network_access_enabled         = false
      [32m+[0m[0m resource_group_name                   = "mydmgmt-dev-consumption-adb-northeurope-rg"
      [32m+[0m[0m sku                                   = "premium"
      [32m+[0m[0m storage_account_identity              = (known after apply)
      [32m+[0m[0m workspace_id                          = (known after apply)
      [32m+[0m[0m workspace_url                         = (known after apply)

      [32m+[0m[0m custom_parameters {
          [32m+[0m[0m nat_gateway_name                                     = (known after apply)
          [32m+[0m[0m no_public_ip                                         = true
          [32m+[0m[0m private_subnet_name                                  = "DatabricksPrivateSubnet"
          [32m+[0m[0m private_subnet_network_security_group_association_id = (known after apply)
          [32m+[0m[0m public_ip_name                                       = (known after apply)
          [32m+[0m[0m public_subnet_name                                   = "DatabricksPublicSubnet"
          [32m+[0m[0m public_subnet_network_security_group_association_id  = (known after apply)
          [32m+[0m[0m storage_account_name                                 = (known after apply)
          [32m+[0m[0m storage_account_sku_name                             = "Standard_LRS"
          [32m+[0m[0m virtual_network_id                                   = (known after apply)
          [32m+[0m[0m vnet_address_prefix                                  = (known after apply)
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace["northeurope"].azurerm_monitor_diagnostic_setting.diagnostic_setting_databricks_workspace["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_databricks_workspace" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.databricks_workspace["northeurope"].azurerm_private_endpoint.private_endpoint_databricks_workspace_browser_authentication[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_browser_authentication" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-northeurope-dbw001-auth-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-northeurope-dbw001-auth-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-consumption-adb-northeurope-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-northeurope-dbw001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-northeurope-dbw001-auth-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "browser_authentication",
            ]
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace["northeurope"].azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_databricks_ui_api" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-northeurope-dbw001-uiapi-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-northeurope-dbw001-uiapi-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-consumption-adb-northeurope-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-northeurope-dbw001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-northeurope-dbw001-uiapi-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "databricks_ui_api",
            ]
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace["northeurope"].time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "10s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_management_zone.module.databricks_workspace["westus"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_databricks_workspace" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.databricks_workspace["westus"].azurerm_databricks_workspace.databricks_workspace[0m will be created
[0m  [32m+[0m[0m resource "azurerm_databricks_workspace" "databricks_workspace" {
      [32m+[0m[0m access_connector_id                   = (known after apply)
      [32m+[0m[0m customer_managed_key_enabled          = false
      [32m+[0m[0m default_storage_firewall_enabled      = true
      [32m+[0m[0m disk_encryption_set_id                = (known after apply)
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled     = true
      [32m+[0m[0m location                              = "westus"
      [32m+[0m[0m managed_disk_identity                 = (known after apply)
      [32m+[0m[0m managed_resource_group_id             = (known after apply)
      [32m+[0m[0m managed_resource_group_name           = "mydmgmt-dev-westus-dbw001-rg"
      [32m+[0m[0m name                                  = "mydmgmt-dev-westus-dbw001"
      [32m+[0m[0m network_security_group_rules_required = "NoAzureDatabricksRules"
      [32m+[0m[0m public_network_access_enabled         = false
      [32m+[0m[0m resource_group_name                   = "mydmgmt-dev-consumption-adb-westus-rg"
      [32m+[0m[0m sku                                   = "premium"
      [32m+[0m[0m storage_account_identity              = (known after apply)
      [32m+[0m[0m workspace_id                          = (known after apply)
      [32m+[0m[0m workspace_url                         = (known after apply)

      [32m+[0m[0m custom_parameters {
          [32m+[0m[0m nat_gateway_name                                     = (known after apply)
          [32m+[0m[0m no_public_ip                                         = true
          [32m+[0m[0m private_subnet_name                                  = "DatabricksPrivateSubnet"
          [32m+[0m[0m private_subnet_network_security_group_association_id = (known after apply)
          [32m+[0m[0m public_ip_name                                       = (known after apply)
          [32m+[0m[0m public_subnet_name                                   = "DatabricksPublicSubnet"
          [32m+[0m[0m public_subnet_network_security_group_association_id  = (known after apply)
          [32m+[0m[0m storage_account_name                                 = (known after apply)
          [32m+[0m[0m storage_account_sku_name                             = "Standard_LRS"
          [32m+[0m[0m virtual_network_id                                   = (known after apply)
          [32m+[0m[0m vnet_address_prefix                                  = (known after apply)
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace["westus"].azurerm_monitor_diagnostic_setting.diagnostic_setting_databricks_workspace["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_databricks_workspace" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.databricks_workspace["westus"].azurerm_private_endpoint.private_endpoint_databricks_workspace_browser_authentication[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_browser_authentication" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-westus-dbw001-auth-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-westus-dbw001-auth-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-consumption-adb-westus-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-westus-dbw001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-westus-dbw001-auth-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "browser_authentication",
            ]
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace["westus"].azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_databricks_ui_api" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-westus-dbw001-uiapi-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-westus-dbw001-uiapi-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-consumption-adb-westus-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-westus-dbw001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-westus-dbw001-uiapi-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "databricks_ui_api",
            ]
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace["westus"].time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "10s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_management_zone.module.key_vault_purview.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.key_vault_purview.azurerm_key_vault.key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [32m+[0m[0m access_policy                   = []
      [32m+[0m[0m enable_rbac_authorization       = true
      [32m+[0m[0m enabled_for_deployment          = false
      [32m+[0m[0m enabled_for_disk_encryption     = false
      [32m+[0m[0m enabled_for_template_deployment = false
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "northeurope"
      [32m+[0m[0m name                            = "mydmgmt-dev-kv001"
      [32m+[0m[0m public_network_access_enabled   = false
      [32m+[0m[0m purge_protection_enabled        = true
      [32m+[0m[0m resource_group_name             = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m sku_name                        = "standard"
      [32m+[0m[0m soft_delete_retention_days      = 7
      [32m+[0m[0m tenant_id                       = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
      [32m+[0m[0m vault_uri                       = (known after apply)

      [32m+[0m[0m contact (known after apply)

      [32m+[0m[0m network_acls {
          [32m+[0m[0m bypass         = "AzureServices"
          [32m+[0m[0m default_action = "Deny"
        }
    }

[1m  # module.data_management_zone.module.key_vault_purview.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_key_vault" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.key_vault_purview.azurerm_private_endpoint.private_endpoint_cognitive_account_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_cognitive_account_vault" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-kv001-vault-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-kv001-vault-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-kv001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-kv001-vault-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "vault",
            ]
        }
    }

[1m  # module.data_management_zone.module.key_vault_purview.azurerm_role_assignment.current_roleassignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "612081e2-c034-4d91-91f8-50c4390fbf50"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Administrator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_management_zone.module.key_vault_purview.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "10s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_management_zone.module.key_vault_scim.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.key_vault_scim.azurerm_key_vault.key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [32m+[0m[0m access_policy                   = []
      [32m+[0m[0m enable_rbac_authorization       = true
      [32m+[0m[0m enabled_for_deployment          = false
      [32m+[0m[0m enabled_for_disk_encryption     = false
      [32m+[0m[0m enabled_for_template_deployment = false
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "northeurope"
      [32m+[0m[0m name                            = "mydmgmt-dev-kv002"
      [32m+[0m[0m public_network_access_enabled   = false
      [32m+[0m[0m purge_protection_enabled        = true
      [32m+[0m[0m resource_group_name             = "mydmgmt-dev-scim-rg"
      [32m+[0m[0m sku_name                        = "standard"
      [32m+[0m[0m soft_delete_retention_days      = 7
      [32m+[0m[0m tenant_id                       = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
      [32m+[0m[0m vault_uri                       = (known after apply)

      [32m+[0m[0m contact (known after apply)

      [32m+[0m[0m network_acls {
          [32m+[0m[0m bypass         = "AzureServices"
          [32m+[0m[0m default_action = "Deny"
        }
    }

[1m  # module.data_management_zone.module.key_vault_scim.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_key_vault" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.key_vault_scim.azurerm_private_endpoint.private_endpoint_cognitive_account_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_cognitive_account_vault" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-kv002-vault-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-kv002-vault-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-scim-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-kv002-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-kv002-vault-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "vault",
            ]
        }
    }

[1m  # module.data_management_zone.module.key_vault_scim.azurerm_role_assignment.current_roleassignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "612081e2-c034-4d91-91f8-50c4390fbf50"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Administrator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_management_zone.module.key_vault_scim.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "10s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_management_zone.module.purview_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_purview_account[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_purview_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.purview_account.azapi_resource.purview_account[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "purview_account" {
      [32m+[0m[0m body                      = {
          [32m+[0m[0m properties = {
              [32m+[0m[0m cloudConnectors                     = [90mnull[0m[0m
              [32m+[0m[0m ingestionStorage                    = {
                  [32m+[0m[0m publicNetworkAccess = "Disabled"
                }
              [32m+[0m[0m managedEventHubState                = "Disabled"
              [32m+[0m[0m managedResourceGroupName            = "mydmgmt-dev-pview001-rg"
              [32m+[0m[0m managedResourcesPublicNetworkAccess = "Disabled"
              [32m+[0m[0m publicNetworkAccess                 = "Enabled"
              [32m+[0m[0m tenantEndpointState                 = "Enabled"
            }
          [32m+[0m[0m sku        = {
              [32m+[0m[0m capacity = 1
              [32m+[0m[0m name     = "Standard"
            }
        }
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = "westus"
      [32m+[0m[0m locks                     = []
      [32m+[0m[0m name                      = "mydmgmt-dev-pview001"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg"
      [32m+[0m[0m response_export_values    = [
          [32m+[0m[0m "*",
        ]
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = {}
      [32m+[0m[0m type                      = "Microsoft.Purview/accounts@2024-04-01-preview"

      [32m+[0m[0m identity {
          [32m+[0m[0m identity_ids = []
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.data_management_zone.module.purview_account.azurerm_monitor_diagnostic_setting.diagnostic_setting_purview_account["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_purview_account" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.purview_account.azurerm_private_endpoint.private_endpoint_purview_account_ingestion_storage_blob[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_purview_account_ingestion_storage_blob" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-ing-blob-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-ing-blob-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = true
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-ing-blob-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m request_message                = "Required for private connection."
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "blob",
            ]
        }
    }

[1m  # module.data_management_zone.module.purview_account.azurerm_private_endpoint.private_endpoint_purview_account_ingestion_storage_queue[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_purview_account_ingestion_storage_queue" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-ing-queue-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-ing-queue-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = true
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-ing-queue-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m request_message                = "Required for private connection."
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "queue",
            ]
        }
    }

[1m  # module.data_management_zone.module.purview_account.azurerm_private_endpoint.private_endpoint_purview_account_platform[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_purview_account_platform" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-platform-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-platform-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.purview-service.microsoft.com",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-platform-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "platform",
            ]
        }
    }

[1m  # module.data_management_zone.module.purview_account.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "10s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_management_zone.module.synapse_private_link_hub.azurerm_private_endpoint.private_endpoint_synapse_private_link_hub_web[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_synapse_private_link_hub_web" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmtdevsynplh001-web-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmtdevsynplh001-web-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-consumption-syn-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmtdevsynplh001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuresynapse.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmtdevsynplh001-web-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "web",
            ]
        }
    }

[1m  # module.data_management_zone.module.synapse_private_link_hub.azurerm_synapse_private_link_hub.synapse_private_link_hub[0m will be created
[0m  [32m+[0m[0m resource "azurerm_synapse_private_link_hub" "synapse_private_link_hub" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "mydmgmtdevsynplh001"
      [32m+[0m[0m resource_group_name = "mydmgmt-dev-consumption-syn-rg"
    }

[1m  # module.data_management_zone.module.synapse_private_link_hub.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "10s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_management_zone.module.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity[0m will be created
[0m  [32m+[0m[0m resource "azurerm_user_assigned_identity" "user_assigned_identity" {
      [32m+[0m[0m client_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "mydmgmt-dev-uai001"
      [32m+[0m[0m principal_id        = (known after apply)
      [32m+[0m[0m resource_group_name = "mydmgmt-dev-automation-rg"
      [32m+[0m[0m tenant_id           = (known after apply)
    }

[1mPlan:[0m 56 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>